cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/services'
tap 'homebrew/science'
tap 'homebrew/versions'

cask 'java'
cask 'xquartz'

brew 'curl'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-gettext']
brew 'htop', args: ['with-ncurses']
brew 'jq'
brew 'mariadb', args: ['with-archive-storage-engine', 'with-bench', 'with-blackhole-storage-engine', 'with-local-infile'], restart_service: true
brew 'wget', args: ['with-gpgme']
brew 'ack'
brew 'youtube-dl'
brew 'coreutils'
brew 'freetype'
brew 'git-flow-avh'
brew 'graphviz', args: ['with-freetype', 'with-x11']
brew 'grc'
brew 'nmap'
brew 'ossp-uuid'
brew 'pwgen'
brew 'redis', restart_service: true
brew 'sqlite', args: ['with-dbstat', 'with-functions']
brew 'ssh-copy-id'
brew 'tree'
brew 'zsh', args: ['with-unicode9']
brew 'certbot'
brew 'dockviz'
brew 'ruby', args: ['with-gdbm', 'with-libffi']
brew 'zsh'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'swig'
brew 'thefuck'


cask 'adobe-reader'
cask 'android-file-transfer'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'launchcontrol'
cask 'little-snitch'
cask 'mysqlworkbench'
cask 'postman'
cask 'sequel-pro'
cask 'skim'
cask 'skype'
cask 'transmission'
cask 'vlc'
