cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/services'
tap 'homebrew/science'
tap 'homebrew/versions'

brew 'curl'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-gettext']
brew 'htop', args: ['with-ncurses']
brew 'jq'
brew 'mariadb', args: ['with-archive-storage-engine', 'with-bench', 'with-blackhole-storage-engine', 'with-local-infile'], restart_service: true
brew 'wget', args: ['with-gpgme']
brew 'ack'
brew 'youtube-dl'
brew 'coreutils'
brew 'freetype'
brew 'git-flow-avh'
brew 'graphviz', args: ['with-freetype']
brew 'grc'
brew 'nmap'
brew 'ossp-uuid'
brew 'pwgen'
brew 'redis', restart_service: true
brew 'sqlite', args: ['with-functions']
brew 'ssh-copy-id'
brew 'tree'
brew 'openssl'
brew 'zsh'

cask 'adobe-reader'
cask 'android-file-transfer'
cask 'atom'
cask 'dashlane'
cask 'dropbox'
cask 'droplr'
cask 'filebot'
cask 'firefox'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'launchcontrol'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'skim'
cask 'skype'
cask 'transmission'
cask 'vlc'
cask 'xquartz'
